[
    {
        "id" : 1,
        "EventName" : "Japanese Invasion of Manchuria",
        "Date" : "September 18, 1931 – February 26, 1932",
        "MajorEvent" : false,
        "lat" : 0,
        "long" : 0,
        "Location" : "Manchuria, Modern Day China",
        "Description" : [["Mukden Incident, (September 18, 1931), also called Manchurian Incident, seizure of the Manchurian city of Mukden (now Shenyang, Liaoning province, China) by Japanese troops in 1931, which was followed by the Japanese invasion of all of Manchuria (now Northeast China) and the establishment of the Japanese-dominated state of Manchukuo (Manzhouguo) in the area. Most observers believe the incident was contrived by the Japanese army, without authorization of the Japanese government, to justify the Japanese invasion and occupation that followed. It contributed to the international isolation of Japan and is seen as a crucial event on the path to the outbreak of World War II.", "japanmanchuria1"], ["Mukden Incident, (September 18, 1931), also called Manchurian Incident, seizure of the Manchurian city of Mukden (now Shenyang, Liaoning province, China) by Japanese troops in 1931, which was followed by the Japanese invasion of all of Manchuria (now Northeast China) and the establishment of the Japanese-dominated state of Manchukuo (Manzhouguo) in the area. Most observers believe the incident was contrived by the Japanese army, without authorization of the Japanese government, to justify the Japanese invasion and occupation that followed. It contributed to the international isolation of Japan and is seen as a crucial event on the path to the outbreak of World War II.", "japanmanchuria2"], ["On the night of September 18, 1931, Japanese troops used the pretext of an explosion along the Japanese-controlled South Manchurian Railway to occupy Mukden; the explosives did little damage to their railway, and trains continued to use the route. Nevertheless, in retaliation for this 'Chinese attack,' the Japanese army began artillery attacks on a nearby Chinese garrison the next day. On September 21, Japanese reinforcements arrived from Korea, and the army began to expand throughout northern Manchuria. In Tokyo neither the high command of the Japanese army nor Prime Minister Wakatsuki Reijirō proved able to restrain the Kwangtung Army in the field, and within three months Japanese troops had spread throughout Manchuria. Wakatsuki’s cabinet fell in December, and its successor reacted to a growing tide of public opinion by sanctioning the invasion.", "japanmanchuria3"], ["The Kwantung Army met little resistance in its conquests because Chiang Kai-shek, who was intent on establishing his control over the rest of China, ordered the commander of the Chinese forces in Manchuria, Zhang Xueliang, to pursue a policy of nonresistance and withdrawal. The League of Nations, Chiang announced, would determine the outcome of the case. The Lytton Commission appointed by the League to investigate the situation labeled Japan as the aggressor, but Japan withdrew from the League and continued to occupy Manchuria until 1945. Few countries recognized the new puppet state of Manchukuo.", "japanmanchuria4"]]
    },
    {
        "id" : 2,
        "EventName" : "Italian Annexation of Ethiopia",
        "Date" : "October 2, 1935 – May 5, 1936",
        "MajorEvent" : false,
        "lat" : 0,
        "long" : 0,
        "Location" : "Ethiopia",
        "description" : [["Italo-Ethiopian War, (1935–36), an armed conflict that resulted in Ethiopia’s subjection to Italian rule. Often seen as one of the episodes that prepared the way for World War II, the war demonstrated the ineffectiveness of the League of Nations when League decisions were not supported by the great powers.", "italyethiopia1"], ["Ethiopia (Abyssinia), which Italy had unsuccessfully tried to conquer in the 1890s, was in 1934 one of the few independent states in a European-dominated Africa. A border incident between Ethiopia and Italian Somaliland that December gave Benito Mussolini an excuse to intervene. Rejecting all arbitration offers, the Italians invaded Ethiopia on October 3, 1935. Under Generals Rodolfo Graziani and Pietro Badoglio, the invading forces steadily pushed back the ill-armed and poorly trained Ethiopian army, winning a major victory near Lake Ascianghi (Ashangi) on April 9, 1936, and taking the capital, Addis Ababa, on May 5. The nation’s leader, Emperor Haile Selassie, went into exile. In Rome, Mussolini proclaimed Italy’s king Victor Emmanuel III emperor of Ethiopia and appointed Badoglio to rule as viceroy.", "italyethiopia2"], ["In response to Ethiopian appeals, the League of Nations condemned the Italian invasion in 1935 and voted to impose economic sanctions on the aggressor. The sanctions remained ineffective because of general lack of support. Although Mussolini’s aggression was viewed with disfavour by the British, who had a stake in East Africa, the other major powers had no real interest in opposing him. The war, by giving substance to Italian imperialist claims, contributed to international tensions between the fascist states and the Western democracies. It also served as a rallying point, especially after World War II, for developing African nationalist movements.", "italyethiopia3"]]
    },
    {
        "id" : 3,
        "EventName" : "Rome-Berlin Axis Created",
        "Date" : "Octobor 21, 1936",
        "MajorEvent" : false,
        "lat" : 0,
        "long" : 0,
        "Location" : "Berlin, Germany",
        "Description" : [["The Italian invasion and annexation of Abyssinia had strained relations between Italy and its allies Britain and France, and Benito Mussolini finally repudiated Italy's alliance with them. Hitler then began planning to draw fascist Italy into an alliance with Nazi Germany. The Spanish civil war provided the opportunity. In July 1936, Fascist rebels led by General Franco took up arms against the Spanish government, and Mussolini intervened in support of the rebels with troops, aeroplanes and arms. As a demonstration of solidarity with Fascist Italy, Hitler also intervened in the Spanish civil war on the side of the Fascist rebels. Germany supplied the rebels with aeroplanes, tanks, technicians, the troops of the Condor Legion, and an air force unit which earned infamy by obliterating the Spanish town of Guernica and its civilian inhabitants. With the assistance of Germany and Italy, General Franco was able to establish a fascist dictatorship in Spain. Hitler followed up his intervention in the Spanish civil war with a warm invitation to the Italian foreign minister to come to Berlin, where on 21 October 1936, Germany and Italy signed a formal alliance which came to be known as the Rome-Berlin Axis. This alliance contained a protocol committing Germany and Italy to follow a common foreign policy. Thereafter, Germany and her partners in military aggression would be known as the Axis powers.", "axis1"]]
    },
    {
        "id" : 4,
        "EventName" : "Japan Aligns with Axis",
        "Date" : "November 25, 1936",
        "MajorEvent" : false,
        "lat" : 0,
        "long" : 0,
        "Location" : "Berlin, Germany",
        "Description" : [["In 1936, Japan had established a lengthy history of aggression in East-Asia and had withdrawn from the League of Nations (forerunner to the United Nations). Japan's imperial government viewed the Soviet Union (formerly, and now Russia) as the main threat to Japan's conquests on the mainland of Asia, and in particular, Japan's puppet state of Manchukuo (formerly the Chinese province of Manchuria). With further territorial expansion on the Asian mainland in mind, Japan began looking for allies who were comfortable with military aggression and likely to support Japan in the event of a military confrontation with the Soviet Union. Hitler was pleased to accommodate Japan, and on 25 November 1936, Japan and Germany signed the Anti-Comintern Pact. The ostensible purpose of the Anti-Comintern Pact was to contain the spread of communism, but it contained a secret protocol which required both parties to consult with a view to safeguarding their common interests if either Germany or Japan was attacked by the Soviet Union. The Japanese viewed the pact as a safeguard of Manchukuo against the Soviet Union seeking to use Japan's puppet state as a means of access to an ice-free Pacific port. With a secret dream to invade and conquer the Soviet Union, Hitler saw this pact as a means to tie up sizeable Russian military resources in East-Asia when he considered the time was ripe to attack the Russians from the west. Italy joined the Pact in 1937.", "anticomintern1"]]
    },
    {
        "id" : 5,
        "EventName" : "Japan Invades China",
        "Date" : "July 7, 1937",
        "MajorEvent" : true,
        "lat" : 39.8502,
        "long" : 116.2191,
        "Location" : "Beijing, China",
        "Description" : [["Second Sino-Japanese War, (1937–45), conflict that broke out when China began a full-scale resistance to the expansion of Japanese influence in its territory (which had begun in 1931). The war, which remained undeclared until December 9, 1941, may be divided into three phases: a period of rapid Japanese advance until the end of 1938, a period of virtual stalemate until 1944, and the final period when Allied counterattacks, principally in the Pacific and on Japan’s home islands, brought about Japan’s surrender. For much of the early 20th century, Japan had exercised effective control of Manchuria, initially through the terms of the Twenty-one Demands (1915) and later through its support of Chinese warlord Zhang Zuolin. However, a serious conflict was developing, and the Chinese in Manchuria were especially restive under the privileges held by the Japanese. Chinese citizens formed the vast majority of the population, and the legal title of the region was held by China. Yet Japan controlled much of south Manchuria through its railways and its leasehold on the Liaodong Peninsula and in other ways that compromised Chinese sovereignty.", "sinojap1"], ["In an attempt to assert their independence, the Chinese began building a series of railroads that would in part encircle the Japanese lines and terminate at Huludao, a port which the Chinese were developing. Zhang Xueliang, Zhang Zuolin’s son and the ruler of Manchuria after his father’s murder by Japanese officers in 1928, was increasingly disposed to ally himself with the Kuomintang (Nationalist Party) and its desire to rid China of foreign control. In the summer of 1931 the friction expressed itself in minor incidents. Those in control of the main body of Japanese forces in Manchuria believed that the time had passed for temporizing and compromise. On the night of September 18–19, 1931, alleging that Chinese had blown up part of the track of the South Manchuria railway near the city, the Japanese seized Mukden (Shenyang). Facing little resistance from Nationalist forces, the Japanese established the puppet state of Manchukuo in 1932 and installed the deposed Qing emperor Puyi as its titular head. Japan soon demonstrated that it was not content with confining its control of China to regions north of the Great Wall, and in the spring of 1934 a pronouncement from Tokyo in effect declared all China to be a Japanese preserve in which no power could take important action without its consent.", "sinojap2"], ["In 1935 the Japanese forced the withdrawal from Hebei and Chahar (now part of Inner Mongolia) of any officials and armed forces that might prove unfriendly to Japan. These territories passed partly into Japanese control, and Suiyuan, Shansi (Shanxi), and Shantung (Shandong) were threatened. Nationalist leader Chiang Kai-shek did not offer open opposition, preferring instead to pursue his campaign against Chinese communist forces. In December 1936, in what came to be known as the Xi’an Incident, Chiang was seized by forces under the command of his own generals and compelled to ally with the communists in a United Front against Japan. In 1935 the Japanese forced the withdrawal from Hebei and Chahar (now part of Inner Mongolia) of any officials and armed forces that might prove unfriendly to Japan. These territories passed partly into Japanese control, and Suiyuan, Shansi (Shanxi), and Shantung (Shandong) were threatened. Nationalist leader Chiang Kai-shek did not offer open opposition, preferring instead to pursue his campaign against Chinese communist forces. In December 1936, in what came to be known as the Xi’an Incident, Chiang was seized by forces under the command of his own generals and compelled to ally with the communists in a United Front against Japan.", "sinojap3"]]
    },
    {
        "id" : 6,
        "EventName" : "The Anschluss",
        "Date" : "March 11, 1938 – March 13, 1938",
        "MajorEvent" : false,
        "lat" : 0,
        "long" : 0,
        "Location" : "Austria",
        "Description" : [["Anschluss, German: “Union”, political union of Austria with Germany, achieved through annexation by Adolf Hitler in 1938. Mooted in 1919 by Austria, Anschluss with Germany remained a hope (chiefly with Austrian Social Democrats) during 1919–33, after which Hitler’s rise to power made it less attractive. In July 1934 Austrian and German Nazis together attempted a coup but were unsuccessful. An authoritarian right-wing government then took power in Austria and kept perhaps half the population from voicing legitimate dissent; that cleavage prevented concerted resistance to the developments of 1938. In February 1938 Hitler invited the Austrian chancellor Kurt von Schuschnigg to Germany and forced him to agree to give the Austrian Nazis virtually a free hand. Earlier in the decade Austria had turned to Italy for support, but by this time Italian leader Benito Mussolini had abandoned the idea of intervening to protect Austria. Still, Schuschnigg later repudiated the agreement and announced a plebiscite on the Anschluss question. He was bullied into canceling the plebiscite, and he obediently resigned, ordering the Austrian Army not to resist the Germans. Pres. Wilhelm Miklas of Austria refused to appoint the Austrian Nazi leader Arthur Seyss-Inquart as chancellor. The German Nazi minister Hermann Göring ordered Seyss-Inquart to send a telegram requesting German military aid, but he refused, and the telegram was sent by a German agent in Vienna. On March 12 Germany invaded, and the enthusiasm that followed gave Hitler the cover to annex Austria outright on March 13. A controlled plebiscite of April 10 gave a 99.7 percent approval. See also international relations: Anschluss and the Munich Pact.", "ansch1"]]
    },
    {
        "id" : 7,
        "EventName" : "The Munich Agreement",
        "Date" : "September 29, 1938",
        "MajorEvent" : false,
        "lat" : 0,
        "long" : 0,
        "Location" : "Munich, Germany",
        "Description" : [["Munich Agreement, (September 30, 1938), settlement reached by Germany, Great Britain, France, and Italy that permitted German annexation of the Sudetenland, in western Czechoslovakia. After his success in absorbing Austria into Germany proper in March 1938, Adolf Hitler looked covetously at Czechoslovakia, where about three million people in the Sudetenland were of German origin. In April he discussed with Wilhelm Keitel, the head of the German Armed Forces High Command, the political and military aspects of “Case Green,” the code name for the envisaged takeover of the Sudetenland. A surprise onslaught “out of a clear sky without any cause or possibility of justification” was rejected because the result would have been “a hostile world opinion which could lead to a critical situation.” Decisive action therefore would take place only after a period of political agitation by the Germans inside Czechoslovakia accompanied by diplomatic squabbling which, as it grew more serious, would either itself build up an excuse for war or produce the occasion for a lightning offensive after some “incident” of German creation. Moreover, disruptive political activities inside Czechoslovakia had been underway since as early as October 1933, when Konrad Henlein founded the Sudetendeutsche Heimatfront (Sudeten-German Home Front).", "munich1"], ["By May 1938 it was known that Hitler and his generals were drawing up a plan for the occupation of Czechoslovakia. The Czechoslovaks were relying on military assistance from France, with which they had an alliance. The Soviet Union also had a treaty with Czechoslovakia, and it indicated willingness to cooperate with France and Great Britain if they decided to come to Czechoslovakia’s defense, but the Soviet Union and its potential services were ignored throughout the crisis. As Hitler continued to make inflammatory speeches demanding that Germans in Czechoslovakia be reunited with their homeland, war seemed imminent. Neither France nor Britain felt prepared to defend Czechoslovakia, however, and both were anxious to avoid a military confrontation with Germany at almost any cost. In France the Popular Front government had come to an end, and on April 8, 1938, Édouard Daladier formed a new cabinet without Socialist participation or Communist support. Four days later Le Temps, whose foreign policy was controlled from the Foreign Ministry, published an article by Joseph Barthelemy, professor at the Paris Law Faculty, in which he scrutinized the Franco-Czechoslovak treaty of alliance of 1924 and concluded that France was not under obligation to go to war in order to save Czechoslovakia. Earlier, on March 22, The Times of London had stated in a leading article by its editor, G.G. Dawson, that Great Britain could not undertake war to preserve Czech sovereignty over the Sudeten Germans without first clearly ascertaining the latter’s wishes; otherwise Great Britain “might well be fighting against the principle of self-determination.","munich2"], ["On April 28–29, 1938, Daladier met with British Prime Minister Neville Chamberlain in London to discuss the situation. Chamberlain, unable to see how Hitler could be prevented from destroying Czechoslovakia altogether if such were his intention (which Chamberlain doubted), argued that Prague should be urged to make territorial concessions to Germany. Both the French and British leadership believed that peace could be saved only by the transfer of the Sudeten German areas from Czechoslovakia. In mid-September Chamberlain offered to go to Hitler’s retreat at Berchtesgaden to discuss the situation personally with the Führer. Hitler agreed to take no military action without further discussion, and Chamberlain agreed to try to persuade his cabinet and the French to accept the results of a plebiscite in the Sudetenland. Daladier and his foreign minister, Georges-Étienne Bonnet, then went to London, where a joint proposal was prepared stipulating that all areas with a population that was more than 50 percent Sudeten German be turned over to Germany. The Czechoslovaks were not consulted. The Czechoslovak government initially rejected the proposal but was forced to accept it on September 21.", "munich3"], ["On September 22 Chamberlain again flew to Germany and met Hitler at Bad Godesberg, where he was dismayed to learn that Hitler had stiffened his demands: he now wanted the Sudetenland occupied by the German army and the Czechoslovaks evacuated from the area by September 28. Chamberlain agreed to submit the new proposal to the Czechoslovaks, who rejected it, as did the British cabinet and the French. On the 24th the French ordered a partial mobilization; the Czechoslovaks had ordered a general mobilization one day earlier. Having at that time one of the world’s best-equipped armies, Czechoslovakia could mobilize 47 divisions, of which 37 were for the German frontier, and the mostly mountainous line of that frontier was strongly fortified. On the German side the final version of “Case Green,” as approved by Hitler on May 30, showed 39 divisions for operations against Czechoslovakia. The Czechoslovaks were ready to fight but could not win alone.", "munich4"], ["In a last-minute effort to avoid war, Chamberlain proposed that a four-power conference be convened immediately to settle the dispute. Hitler agreed, and on September 29 Hitler, Chamberlain, Daladier, and Italian dictator Benito Mussolini met in Munich. The meeting in Munich started shortly before 1 PM. Hitler could not conceal his anger that, instead of entering the Sudetenland as a liberator at the head of his army on the day fixed by himself, he had to abide by the three Powers’ arbitration, and none of his interlocutors dared insist that the two Czech diplomats waiting in a Munich hotel should be admitted to the conference room or consulted on the agenda. Nevertheless, Mussolini introduced a written plan that was accepted by all as the Munich Agreement. (Many years later it was discovered that the so-called Italian plan had been prepared in the German Foreign Office.) It was almost identical to the Godesberg proposal: the German army was to complete the occupation of the Sudetenland by October 10, and an international commission would decide the future of other disputed areas. Czechoslovakia was informed by Britain and France that it could either resist Germany alone or submit to the prescribed annexations. The Czechoslovak government chose to submit. Before leaving Munich, Chamberlain and Hitler signed a paper declaring their mutual desire to resolve differences through consultation to assure peace. Both Daladier and Chamberlain returned home to jubilant welcoming crowds relieved that the threat of war had passed, and Chamberlain told the British public that he had achieved “peace with honour. I believe it is peace for our time.” His words were immediately challenged by his greatest critic, Winston Churchill, who declared, “You were given the choice between war and dishonour. You chose dishonour and you will have war.” Indeed, Chamberlain’s policies were discredited the following year, when Hitler annexed the remainder of Czechoslovakia in March and then precipitated World War II by invading Poland in September. The Munich Agreement became a byword for the futility of appeasing expansionist totalitarian states, although it did buy time for the Allies to increase their military preparedness.", "munich5"]]
    },
    {
        "id" : 8,
        "EventName" : "Molotov-Ribbentrop Pact Signed",
        "Date" : "August 23, 1939",
        "MajorEvent" : true,
        "lat" : 55.7558,
        "long" : 37.6173,
        "Location" : "Moscow, Russia",
        "Description" : [["German-Soviet Nonaggression Pact, also called Nazi-Soviet Nonaggression Pact, German-Soviet Treaty of Nonaggression, Hitler-Stalin Pact, Molotov-Ribbentrop Pact, (August 23, 1939), nonaggression pact between Germany and the Soviet Union that was concluded only a few days before the beginning of World War II and which divided eastern Europe into German and Soviet spheres of influence. The Soviet Union had been unable to reach a collective-security agreement with Britain and France against Nazi Germany, most notably at the time of the Munich Conference in September 1938. By early 1939 the Soviets faced the prospect of resisting German military expansion in eastern Europe virtually alone, and so they began searching about for a change of policy. On May 3, 1939, Soviet leader Joseph Stalin fired Foreign Minister Maksim Litvinov, who was Jewish and an advocate of collective security, and replaced him with Vyacheslav Mikhaylovich Molotov, who soon began negotiations with the Nazi foreign minister, Joachim von Ribbentrop. The Soviets also kept negotiating with Britain and France, but in the end Stalin chose to reach an agreement with Germany. By doing so he hoped to keep the Soviet Union at peace with Germany and to gain time to build up the Soviet military establishment, which had been badly weakened by the purge of the Red Army officer corps in 1937. The Western democracies’ hesitance in opposing Adolf Hitler, along with Stalin’s own inexplicable personal preference for the Nazis, also played a part in Stalin’s final choice. For his part, Hitler wanted a nonaggression pact with the Soviet Union so that his armies could invade Poland virtually unopposed by a major power, after which Germany could deal with the forces of France and Britain in the west without having to simultaneously fight the Soviet Union on a second front in the east. The end result of the German-Soviet negotiations was the Nonaggression Pact, which was dated August 23 and was signed by Ribbentrop and Molotov in the presence of Stalin, in Moscow.", "mr1"], ["The terms of the German-Soviet Nonaggression Pact were briefly as follows: the two countries agreed not to attack each other, either independently or in conjunction with other powers; not to support any third power that might attack the other party to the pact; to remain in consultation with each other upon questions touching their common interests; not to join any group of powers directly or indirectly threatening one of the two parties; to solve all differences between the two by negotiation or arbitration. The pact was to last for 10 years, with automatic extension for another 5 years unless either party gave notice to terminate it 1 year before its expiration. To this public pact of nonaggression was appended a secret protocol, also reached on August 23, 1939, which divided the whole of eastern Europe into German and Soviet spheres of influence. Poland east of the line formed by the Narew, Vistula, and San rivers would fall under the Soviet sphere of influence. The protocol also assigned Lithuania, Latvia, Estonia, and Finland to the Soviet sphere of influence and, further, broached the subject of the separation of Bessarabia from Romania. A secret supplementary protocol (signed September 28, 1939) clarified the Lithuanian borders. The Polish-German border was also determined, and Bessarabia was assigned to the Soviet sphere of influence. In a third secret protocol (signed January 10, 1941, by Count Friedrich Werner von Schulenberg and Molotov), Germany renounced its claims to portions of Lithuania in return for Soviet payment of a sum agreed upon by the two countries.", "mr2"], ["The public German-Soviet Nonaggression Pact caused consternation in the capitals of Britain and France. After Germany invaded Poland from the west on September 1, 1939, Soviet troops invaded Poland from the east on September 17, meeting the advancing Germans near Brest-Litovsk two days later. The partition of Poland was effected on September 29, at which time the dividing line between German and Soviet territory was changed in Germany’s favour, being moved eastward to the Bug River (i.e., the current Polish-Soviet frontier). The Soviets soon afterward sought to consolidate their sphere of influence as a defensive barrier to renewed German aggression in the east. Accordingly, the Soviet Union attacked Finland on November 30 and forced it in March 1940 to yield the Isthmus of Karelia and make other concessions. The Baltic republics of Latvia, Lithuania, and Estonia were annexed by the Soviet Union and were organized as Soviet republics in August 1940. The Nonaggression Pact became a dead letter on June 22, 1941, when Nazi Germany, after having invaded much of western and central Europe, attacked the Soviet Union without warning in Operation Barbarossa. The Soviet Union’s borders with Poland and Romania that were established after World War II roughly follow those established by the Nonaggression Pact in 1939–41. Until 1989 the Soviet Union denied the existence of the secret protocols because they were considered evidence of its involuntary annexation of the Baltic states. Soviet leaders were initially unwilling to restore prewar boundaries, but the transformations occurring within the Soviet Union in the early 1990s made it virtually impossible for Soviet leaders to combat declarations of independence from the Baltic states in 1991.", "mr3"]]
    },
    {
        "id" : 9,
        "EventName" : "German Invasion of Poland",
        "Date" : "September 1, 1939",
        "MajorEvent" : true,
        "lat" : 54.3520,
        "long" : 18.6466,
        "Location" : "The Beginning of WW2",
        "Description" : [["Britain and France essentially acquiesced to Germany's rearmament (1935-1937), remilitarization of the Rhineland (1936), and annexation of Austria (March 1938). In September 1938, after signing away the Czech border regions, known as the Sudetenland, View This Term in the Glossary to Germany at the Munich conference, British and French leaders pressured France's ally, Czechoslovakia, to yield to Germany's demand for the incorporation of those regions. Despite Anglo-French guarantees of the integrity of rump Czechoslovakia, the Germans dismembered the Czechoslovak state in March 1939, in violation of the Munich agreement. Britain and France responded by guaranteeing the integrity of the Polish state. Hitler went on to negotiate a nonaggression pact with the Soviet Union. The German-Soviet Pact of August 1939, which secretly stated that Poland was to be partitioned between the two powers, enabled Germany to attack Poland without the fear of Soviet intervention.", "poland1"], ["On September 1, 1939, Germany invaded Poland. To justify the action, Nazi propagandists falsely claimed that Poland had been planning, with its allies Great Britain and France, to encircle and dismember Germany and that Poles were persecuting ethnic Germans. The SS, in collusion with the German military, staged a phony Polish attack on a German radio station. Hitler then used this action to launch a “retaliatory” campaign against Poland. Poland mobilized late, and political considerations forced its army into a disadvantageous deployment. The Poles were also heavily outnumbered. Despite fighting tenaciously and inflicting serious casualties on the Germans, the Polish army was defeated within weeks. From East Prussia and Germany in the north and Silesia and Slovakia in the south, German units, with more than 2,000 tanks and over 1,000 planes, broke through Polish defenses along the border and advanced on Warsaw in a massive encirclement attack. After heavy shelling and bombing, Warsaw surrendered to the Germans on September 27, 1939. Britain and France, standing by their guarantee of Poland's border, had declared war on Germany on September 3, 1939. The Soviet Union invaded eastern Poland on September 17, 1939. The last resistance ended on October 6. The demarcation line for the partition of German- and Soviet-occupied Poland was along the Bug River.", "poland2"], ["In October 1939, Germany directly annexed former Polish territories along German's eastern border: West Prussia, Poznan, Upper Silesia, and the former Free City of Danzig. The remainder of German-occupied Poland (including the cities of Warsaw, Krakow, Radom, and Lublin) was organized as the so-called Generalgouvernement (General Government) under a civilian governor general, the Nazi Party lawyer Hans Frank.Nazi Germany occupied the remainder of Poland when it invaded the Soviet Union in June 1941. Poland remained under German occupation until January 1945.", "poland3"]]
    },
    {
        "id" : 10,
        "EventName" : "German Invasion of Denmark and Norway",
        "Date" : "April 9, 1940",
        "MajorEvent" : false,
        "lat" : 0,
        "long" : 0,
        "Location" : "Northern Europe",
        "Description" : [["On April 9, 1940, German warships enter major Norwegian ports, from Narvik to Oslo, deploying thousands of German troops and occupying Norway. At the same time, German forces occupy Copenhagen, among other Danish cities. German forces were able to slip through the mines Britain had laid around Norwegian ports because local garrisons were ordered to allow the Germans to land unopposed. The order came from a Norwegian commander loyal to Norway’s pro-fascist former foreign minister Vidkun Quisling. Hours after the invasion, the German minister in Oslo demanded Norway’s surrender. The Norwegian government refused, and the Germans responded with a parachute invasion and the establishment of a puppet regime led by Quisling (whose name would become a synonym for “traitor”). Norwegian forces refused to accept German rule in the guise of a Quisling government and continued to fight alongside British troops. But an accelerating German offensive in France led Britain to transfer thousand of soldiers from Norway to France, resulting ultimately in a German victory. In Denmark, King Christian X, convinced his army could not fight off a German invasion, surrendered almost immediately. Hitler now added a second and third conquered nation to his quarry, which began with Poland.", "nd1"]]
    },
    {
        "id" : 11,
        "EventName" : "German Invasion of France",
        "Date" : "May 10, 1940",
        "MajorEvent" : true,
        "lat" : 49.7625,
        "long" : 4.6285,
        "Location" : "Ardennes, France",
        "Description" : [["The attack began on 10 May 1940, with German air raids on Belgium and Holland, followed by parachute drops and attacks by ground forces. The two beleaguered nations were hastily added to the anti-German ad-hoc coalition that included France and Britain, but this only served to further complicate Allied command and control arrangements. The Germans seized the initiative, capturing the key Belgian fort of Eban Emael with a daring airborne operation. The speed of the German advance and the brutality of the air raids gave them a huge psychological advantage, and on 14 May the Dutch surrendered. The British and French had responded to the original attack by putting into operation a plan to advance to the River Dyle, in Belgium. The Allies pushed their best forces, including the British, into Belgium. Although the initial stages went reasonably well, a French force advancing towards Breda, in Holland, was pushed back. It soon became clear that by advancing into the Low Countries the Allies were dancing to Hitler's tune. On 13 May, the first German forces emerged from the Ardennes near Sedan, on the River Meuse. In a two-day battle, the Panzers crossed the river, despite some surprisingly stiff resistance from the second-class French defenders, and near-suicidal attacks by Allied aircraft.", "bof1"], ["A potentially decisive counterattack by two high quality French armoured and motorised divisions fizzled out into some fierce, but ultimately inconclusive fighting. Under the dynamic command of General Heinz Guderian, a pioneer of armoured warfare known euphemistically as 'Hurry-up Heinz', the German Panzers broke out of their bridgehead. They began to race towards the Channel coast, aided by the German aircraft that ruled the skies.With the bulk of the Allied forces fighting in Belgium, there was little to stop the German forces as they sliced across the Allied supply-lines. The German spearheads reached the English Channel on 20 May.Lacking a centrally placed strategic reserve, the Allies tried to pull their armies out of Belgium to respond to the new threat emerging in their rear. And the Germans did not have it all their own way, as French forces under Charles de Gaulle showed how vulnerable the flanks of the German forces were to bold counterattacks.", "bof2"], ["Allied high command seemed paralysed. General Weygand replaced General Gamelin as French commander-in-chief, but it made no difference. Then General Lord Gort, the commander of the British Expeditionary Force (BEF), on 23/4 May took the morally courageous decision to abandon his role in a projected Anglo-French counterattack, and fell back on the Channel ports. The French, not surprisingly, regarded this as a betrayal, but Gort's decision saved the BEF. Between 26 May and 4 June, a hastily organised evacuation by sea, code-named Operation Dynamo, lifted 338,000 Allied troops from Dunkirk. That the German forces failed to press their attack on Dunkirk was largely thanks to grim defence of the Dunkirk perimeter by British and French troops, and the efforts of the much-depleted RAF. Although as Churchill, who had become Prime Minster on 10 May rightly commented, 'wars are not won by evacuation', Dynamo was a victory of incalculable importance for the BEF. The return of the troops, even without much of their equipment, gave Britain a basis on which to rebuild the Army, sheltering behind the Navy and the RAF. It also strengthened the credibility of Churchill's insistence that Britain would fight on, thus influencing the neutral USA at a time when American aid was vital.", "bof3"], ["The second act of the Battle of France began on 5 June, with the Germans striking southwards from the River Somme. Despite the fact that the French in many areas fought well, the Germans destroyed the Allied forces in the field in short order. The 51st Highland Division, which had not been grouped with the rest of the British army, was surrounded at St Valéry-en-Caux, and was forced to surrender on 12 June. The Germans launched a major offensive on Paris on 9 June, and on 13 June Paris was declared an open city, as the French government fled to Bordeaux. The first German troops entered the French capital on 14 June, little more than a month after the campaign began. There were still spasms of fighting. A fresh British force was sent to Normandy, only to be evacuated almost immediately. The Royal Navy carried out evacuations from ports down the French coast almost as far as the Spanish frontier. Meanwhile, the victorious Panzers raced in different directions across France, finishing off pockets of resistance, crossing the River Loire in the west on 17 June, and reaching the Swiss frontier a few days later. The end came with the surrender of France on 22 June. Hitler insisted on signing the document of capitulation in the same railway carriage used when Germany had surrendered in 1918. The humiliation of France was complete.", "bof4"]]
    },
    {
        "id" : 12,
        "EventName" : "Battle of Britain",
        "Date" : "July 10, 1940",
        "MajorEvent" : true,
        "lat" : 51.5030,
        "long" : 0.1234,
        "Location" : "United Kingdom",
        "Description" : [["By the start of World War II in 1939, the Luftwaffe was the strongest and best-trained air force in the world. They played a crucial role in Germany’s methodical and highly effective invasion of much of Western Europe, including Poland, Holland, Belgium and France. After France fell to Germany on June 22, 1940, Hitler set his sights on the Soviet Union but still had to contend with Great Britain. He planned a massive invasion by land and sea, code named Operation Sea Lion, but knew he needed to defeat the RAF first. Hitler hoped his Luftwaffe and its fierce reputation would intimidate Britain enough that they would surrender peacefully, and even dangled the prospect of a peace treaty. However, he underestimated the resolve of Britain’s people, its military and its combative new prime minister, Winston Churchill, who rejected the offer outright. Churchill believed Hitler and the evils of Nazism had to be abolished no matter what. He knew that the RAF was Britain’s main defense against German troops crossing the English Channel.", "bob1"], ["Days before France’s surrender, Churchill gave his famous 'Finest Hour' speech to the House of Commons, making it clear he had no intention of capitulating to Hitler, although some members of Parliament hoped to negotiate peace. In his speech, Churchill said, 'the Battle of France is over. I expect the Battle of Britain is about to begin.' He spoke of his certainty that the Luftwaffe would attack Britain hard, but also his confidence that the RAF, commanded by Air Chief Marshal Hugh Dowding, would hold their own and be victorious. Churchill knew failure was not an option, and his powerful speech boosted the morale and patriotism of the British people, its military and Parliament.", "bob2"], ["Hitler and many of his generals were unprepared to invade Britain. Göring, however, was confident his Luftwaffe would quickly destroy the RAF with his German bombers and prevent, or at least postpone, the need for a full-scale invasion; Hitler gave him the go-ahead to prove it. On July 10, 1940, the Luftwaffe attacked Britain, performing reconnaissance missions and targeting coastal defenses, ports and radar stations. Their efforts, however, did little damage to the RAF. In mid-August, using mostly single-engine Messerschmitt BF-109 combat planes, the Luftwaffe began attacking Britain’s airfields, air fighter production sites and targeting RAF Supermarine Spitfires and Hawker Hurricanes in the air.", "bob5"], ["Despite being outnumbered, the RAF retaliated by bombing Berlin. Enraged, Hitler and Göring changed tactics and ordered a bombing campaign known as “the Blitz” against London, Liverpool, Coventry and other major cities, hoping to decimate the morale of the British people. To ensure massive casualties, German bombing was carried out at night. On September 15, the Luftwaffe began two massive raids on London, eager to force the British to the negotiating table, but they could not defeat the RAF or gain control of British airspace. The Luftwaffe was by then stretched too thin, poorly organized and unable to keep up with the demand for new fighter planes or overcome the RAF’s superior technology.", "bob3"], ["By the end of October 1940, Hitler called off his planned invasion of Britain and the Battle of Britain ended. Both sides suffered enormous loss of life and aircraft. Still, Britain weakened the Luftwaffe and prevented Germany from achieving air superiority. It was the first major defeat of the war for Hitler. Although Britain stood alone against Germany after the fall of France, nearly a quarter of the RAF pilots who participated in the Battle of Britain were from other countries including Poland, New Zealand, Australia, Canada, Czechoslovakia, Belgium, France, the United States and South Africa. The British won the Battle of Britain due to a confluence of factors. They were defending their home territory, so were more motivated to succeed, and also knew the local geography better than the invaders. Another major factor was the Dowding System, named after Sir Hugh Dowding, Commander in Chief of the RAF Fighting Command. The Dowding System’s pioneering use of radar (which could warn the RAF of enemy attacks), aircraft and ground defense gave Great Britain a competitive advantage.The Battle of Britain was a turning point in World War II; if the RAF had not held off the Luftwaffe, Hitler would have likely moved forward with his Operation Sea Lion invasion of the British Isles. This would have been devastating to the British people and all efforts to stem Hitler’s rise to power. Germany needed to control the English Channel to invade Britain, and the battle prevented them from gaining that valuable control.", "bob4"]]
    },
    {
        "id" : 13,
        "EventName" : "Italian Invasion of Egypt",
        "Date" : "September 13, 1940",
        "MajorEvent" : true,
        "lat" : 31.6104,
        "long" : 25.9249,
        "Location" : "Egypt",
        "Description" : [["The Italian invasion of Egypt in WWII lasted from September 13 to September 16, 1940, and was a strategic military operation against the British army for the purpose of invading and seizing Egypt during the North African campaign. The Italian troops in Egypt progressed about 50 miles and after four days stopped the offensive near Sidi Barrani. The British troops yielded to their numbers and did not give serious resistance and retreated to the city of Mersa Matruh. Between the belligerents, a “no man’s zone” was formed 130 km wide. Egypt was formally considered an independent state in 1922, but the functions of the king, parliament, and military were controlled. Egypt was completely subordinate to Britain. In 1936, a British-Egyptian agreement was signed, under which British troops had the right to occupy the territory of Egypt in the event of a threat to the Suez Canal. After June 10, 1940, Italy declared war on Britain and joined the Axis countries. On June 13, the Egyptian parliament broke off diplomatic relations with Italy, and declared it would remain neutral, until Italian troops invaded the Egyptian territory. Italy had two armies in Libya at the beginning of the war: the 5th, located in Tripolitania on the border with French North Africa, and the 10th, stationed on the border with Egypt. After the capitulation of France, part of the forces of the Fifth Army was transferred to the junction with the 10th. By September 1940, the 10th Italian Army included 10 divisions and the 5th Army four divisions. However, the Italian troops that prepared for the offensive had insufficient armament and transportation.", "italy1"], ["On September 7, Mussolini signed an order demanding that R. Graziani go on the offensive in two days, regardless of whether the German troops would land in the UK or not (in the original version of the plan, it was intended to launch an offensive on the same day, with disembarkation of the German army). On June 17, all the British troops stationed in Egypt were united in the Nile army under the command of Richard O’Connor. Even before the outbreak of hostilities, the British troops began to carry out provocations on the border; but until September, everything was limited to small border clashes. As early as September 9, the Italian Air Force was active. On that day, bombers accompanied by fighters attacked the British airfields in Sidi Barrani, Maaten Bagos, and Mersa Matruh. In response, the British launched air strikes against airfields, supply points and concentrations of Italian troops. According to the original plan, the Italian troops were to advance in two directions: the 23rd Corps was to advance on the coastal strip along the road, while the Libyan Corps with the mechanized group of Maletti moved southwards through the desert. The 21st Corps was in reserve and was located in the area of Tobruk. The 5th Air Squadron’s task was to cover its’ troops in the areas of concentration, destroy command posts, supply points and enemy airfields in the first stage. In the second stage, the Air Force was to attack the enemy’s defending forces directly and defend their own. However, Graziani did not receive the necessary number of vehicles for two Libyan divisions, without which the interaction with the mechanized group of Maletti lost all viability. The plan was changed urgently. The group of Maletti was to carry out the flanking maneuver independently, and both Libyan divisions advanced in the first echelon in the coastal strip. In the second stage, the 1st division of blackshirts moved into the breakthrough, with a sufficient number of vehicles. On September 11th, the group of Maletti was lost in the desert on the way to Sidi-Omar’s initial positions. This event, together with intelligence reports on the presence of large British armored forces south of the coastal strip, forced Graziani to once again change the offensive plan. The flank maneuver was abolished altogether, and the group of Maletti was transferred under the leadership of the commander of the 10th Army for closer interaction with troops advancing in the coastal strip.", "italy2"], ["On the night of September 12-13, a large number of special bombs were dropped by the Italian aircraft, which acted as mines, with which the soldiers of the 11th Hussar Regiment had a problem early in the morning. The same morning, Italian artillery bombarded the Musaida area and the airfield and the empty barracks of Es Sallum. After the artillery barrage, the troops of the 10th Army launched an offensive and crossed the Egyptian border. According to English descriptions, this offensive by the Italians was more like the passage of troops in a parade than a military operation. Parts of the 1st Libyan Division soon occupied Es-Sallum. The small British forces holding back the Italians, who were advancing towards the passage of Khalfan, were forced to retreat to the east under the pressure of tanks and artillery. Towards evening, two large columns of Italian troops joined the passage of Khalfan. In the afternoon of September 14, British troops in the coastal area retreated to pre-prepared positions east of Buk-Buk, where the next day they were reinforced. The Italian units reached the British position by the middle of the day on September 15, where they were fired on by horse artillery. Due to a shortage of ammunition, the British were forced to retreat, and by the end of the day, the Italians occupied Buk-Buk. On the morning of September 16, the British guards occupied positions at Alam-Hamid. In the afternoon, because of tank fire, they were forced to withdraw to Alam al-Dab. The column of the advancing Italian tanks and trucks turned north towards the plateau. Under the threat of encirclement, the British left Sidi-Barrani and took up positions at Maarten-Mohammed. On this, having walked in general about 50 miles, the offensive of the Italian troops stalled. Despite their considerable advantage in numbers, the Italians were not able to achieve serious success during the operation. The Italian offensive was stopped for many reasons. The British settled on pre-prepared positions near the city of Mersa Matruh. The indecisiveness of the Italian command gave time for the British to muster their forces for a counter-offensive.", "italy3"]]
    },
    {
        "id" : 14,
        "EventName" : "Triparite Pact Signed",
        "Date" : "September 27, 1940",
        "MajorEvent" : false,
        "lat" : 0,
        "long" : 0,
        "Location" : "Berlin, Germany",
        "Description" : [["On September 27, 1940, the Axis powers are formed as Germany, Italy and Japan become allies with the signing of the Tripartite Pact in Berlin. The Pact provided for mutual assistance should any of the signatories suffer attack by any nation not already involved in the war. This formalizing of the alliance was aimed directly at “neutral” America—designed to force the United States to think twice before venturing in on the side of the Allies. The Pact also recognized the two spheres of influence. Japan acknowledged “the leadership of Germany and Italy in the establishment of a new order in Europe,” while Japan was granted lordship over “Greater East Asia.” A footnote: There was a fourth signatory to the Pact—Hungary, which was dragged into the Axis alliance by Germany in November 1940.", "tps1"]]
    },
    {
        "id" : 15,
        "EventName" : "Italy Invades Greece",
        "Date" : "October 28, 1940",
        "MajorEvent" : false,
        "lat" : 0,
        "long" : 0,
        "Location" : "Greece",
        "Description" : [["On October 28, 1940, Mussolini’s army, already occupying Albania, invades Greece in what will prove to be a disastrous military campaign for the Duce’s forces. Mussolini surprised everyone with this move against Greece; even his ally, Adolf Hitler, was caught off-guard, especially since the Duce had led Hitler to believe he had no such intention. Hitler denounced the move as a major strategic blunder. According to Hitler, Mussolini should have concentrated on North Africa, continuing the advance into Egypt. Even Mussolini’s own chief of army staff found out about the invasion only after the fact. Despite being warned off an invasion of Greece by his own generals, despite the lack of preparedness on the part of his military, despite that it would mean getting bogged down in a mountainous country during the rainy season against an army willing to fight tooth and nail to defend its autonomy, Mussolini moved ahead out of sheer hubris, convinced he could defeat the Greeks in a matter of days. He also knew a secret, that millions of lire had been put aside to bribe Greek politicians and generals not to resist the Italian invasion. Whether the money ever made it past the Italian fascist agents delegated with the responsibility is unclear; if it did, it clearly made no difference whatsoever-the Greeks succeeded in pushing the Italian invaders back into Albania after just one week, and the Axis power spent the next three months fighting for its life in a defensive battle. To make matters worse, virtually half the Italian fleet at Taranto had been crippled by a British carrier-based attack. Mussolini had been humiliated.", "greece1"]]
    },
    {
        "id" : 16,
        "EventName" : "Operation Barbarossa Begins",
        "Date" : "June 22, 1941",
        "MajorEvent" : true,
        "lat" : 53.1325,
        "long" : 23.1688,
        "Location" : "Soviet Union",
        "Description" : [["Under the codename Operation “Barbarossa,” Nazi Germany invaded the Soviet Union on June 22, 1941. This was the largest German military operation of World War II. Since the 1920s, core policies of the Nazi movement included: the destruction of the Soviet Union by military force; the permanent elimination of the perceived Communist threat to Germany; and the seizure of prime land within Soviet borders as Lebensraum (“Living space”) for long-term German settlement. As such, Adolf Hitler had always regarded the August 23, 1939 German-Soviet nonaggression pact (commonly referred to as the Molotov-Ribbentrop Pact) as a temporary tactical maneuver. In July 1940, just weeks after the German conquest of France and the Low Countries (Belgium, Luxembourg, and the Netherlands), Hitler decided to attack the Soviet Union within the following year. On December 18, 1940, he signed Directive 21 (code-named Operation “Barbarossa”). This was the first operational order for the invasion of the Soviet Union. From the beginning of operational planning, German military and police authorities intended to wage a war of annihilation against both the Soviet Union’s “Judeo-Bolshevik” Communist government and its citizens, particularly the Jews. During the winter and spring months of 1941, officials of the Army High Command (Oberkommando des Heeres-OKH) and the Reich Security Main Office (Reichssicherheitshauptamt-RSHA) negotiated arrangements for the deployment of Einsatzgruppen behind the front lines. The Einsatzgruppen View This Term in the Glossary would conduct mass shootings of Jews, Communists, and other persons deemed to be dangerous to establishing long-term German rule on Soviet territory. Often referred to as mobile killing units, they were special units of the Security Police and the Security Service (Sicherheitsdienst-SD). In addition, the German military planned that tens of millions of Soviet citizens would starve to death as the intentional result of German occupation policies.", "barb1"], ["With 134 divisions at full fighting strength and 73 more divisions for deployment behind the front, German forces invaded the Soviet Union on June 22, 1941. The invasion began less than two years after the German-Soviet Pact was signed. Three army groups attacked the Soviet Union across a broad front. These groups included more than three million German soldiers. The soldiers were supported by 650,000 troops from Germany’s allies (Finland and Romania). These troops were later augmented by units from Italy, Croatia, Slovakia, and Hungary. The front stretched from the Baltic Sea in the north to the Black Sea in the south. For months, the Soviet leadership had refused to heed warnings from the Western powers of the German troop buildup along its western border. Thus, Germany and its Axis partners achieved almost complete tactical surprise. Much of the existing Soviet air force was destroyed on the ground. The Soviet armies were initially overwhelmed. German units encircled millions of Soviet soldiers. Cut off from supplies and reinforcements, the Soviet soldiers had few options other than to surrender. As the German army advanced deep into Soviet territory, SS and police units followed the troops. The first to arrive were the Einsatzgruppen. View This Term in the Glossary The RSHA tasked these units with: identifying and eliminating people who might organize and carry out resistance to the German occupation forces; identifying and concentrating groups of people who were considered potential threats to German rule in the East; establishing intelligence networks; and securing key documentation and facilities", "barb2"], ["The Einsatzgruppen View This Term in the Glossary initiated mass shooting operations. These mass shootings primarily targeted Jewish males, officials of the Communist Party and Soviet state, and Roma. View This Term in the Glossary They established ghettos and other holding facilities to concentrate large numbers of Soviet Jews, often with assistance from German Army personnel. In late July, Heinrich Himmler's representatives (the Higher SS and Police Leaders) arrived in the Soviet Union. The SS and police, supported by locally recruited auxiliaries, began to shoot entire Jewish communities there. Hitler decided to deport German Jews to the occupied Soviet Union beginning on October 15, 1941. Contributing to this decision were the rapid advances both on the military front and in the murder of the Soviet Jews. The decision initiated the policy that would become known as the “Final Solution.” The “Final Solution” was the physical annihilation not only of Jews in the German-occupied East, but of Jews throughout Europe. The Soviet Union saw catastrophic military losses in the first six weeks after the German attack. However, the Soviet Union failed to collapse as anticipated by the Nazi leadership and the German military commanders. In mid-August 1941, Soviet resistance stiffened. This knocked the Germans off their timetable of winning the war by autumn 1941. Nevertheless, by late September 1941, German forces reached the gates of the Russian city Leningrad (today, St. Petersburg) in the north. They also took Smolensk, a city in Russia located over 200 miles southwest of Moscow, as well as Dnepropetrovsk (Dnipropetrovs’k; today Dnipro), a city in Ukraine located over 200 miles southeast of Kyiv. German forces spilled into the Crimean Peninsula in the south. They reached the outskirts of Moscow in early December. After months of campaigning, however, the German army was exhausted. Having expected a rapid Soviet collapse, German planners had failed to equip their troops for winter warfare. They did not provide sufficient food and medicines, as they had expected their military personnel to live off the land of a conquered Soviet Union at the expense of the local population. Consequently, the Germans forces—overstretched along the 1,000 mile Eastern Front—became vulnerable to Soviet counterattack. On December 6, 1941, the Soviet Union launched a major offensive against the center of the front. This drove the Germans back from Moscow in chaos. It took weeks for the Germans to stabilize the front east of Smolensk. In the summer of 1942, Germany resumed the offensive with a massive attack to the south and southeast toward the city of Stalingrad (Volgograd) on the Volga River and toward the oil fields of the Caucasus. In September 1942, the Germans reached the outskirts of Stalingrad and approached Groznyy in the Caucasus, approximately 120 miles from the shores of the Caspian Sea. This marked the farthest geographical extent of German domination in Europe during World War II.", "barb3"]]
    },
    {
        "id" : 17,
        "EventName" : "Japan Bombs Pearl Harbor",
        "Date" : "December 7, 1941",
        "MajorEvent" : true,
        "lat" : 21.3487,
        "long" : -157.9440,
        "Location" : "Pearl Harbor, Hawaii",
        "Description" : [["Pearl Harbor is a U.S. naval base near Honolulu, Hawaii, that was the scene of a devastating surprise attack by Japanese forces on December 7, 1941. Just before 8 a.m. on that Sunday morning, hundreds of Japanese fighter planes descended on the base, where they managed to destroy or damage nearly 20 American naval vessels, including eight battleships, and over 300 airplanes. More than 2,400 Americans died in the attack, including civilians, and another 1,000 people were wounded. The day after the assault, President Franklin D. Roosevelt asked Congress to declare war on Japan. The attack on Pearl Harbor was a surprise, but Japan and the United States had been edging toward war for decades. The United States was particularly unhappy with Japan’s increasingly belligerent attitude toward China. The Japanese government believed that the only way to solve its economic and demographic problems was to expand into its neighbor’s territory and take over its import market. To this end, Japan declared war on China in 1937, resulting in the Nanking Massacre and other atrocities. American officials responded to this aggression with a battery of economic sanctions and trade embargoes. They reasoned that without access to money and goods, and especially essential supplies like oil, Japan would have to rein in its expansionism. Instead, the sanctions made the Japanese more determined to stand their ground. During months of negotiations between Tokyo and Washington, D.C., neither side would budge. It seemed that war was all but inevitable.", "pearl1"],["Pearl Harbor, Hawaii, is located near the center of the Pacific Ocean, roughly 2,000 miles from the U.S. mainland and about 4,000 miles from Japan. No one believed that the Japanese would start a war with an attack on the distant islands of Hawaii. Additionally, American intelligence officials were confident that any Japanese attack would take place in one of the (relatively) nearby European colonies in the South Pacific: the Dutch East Indies, Singapore or Indochina. Because American military leaders were not expecting an attack so close to home, the naval facilities at Pearl Harbor were relatively undefended. Almost the entire Pacific Fleet was moored around Ford Island in the harbor, and hundreds of airplanes were squeezed onto adjacent airfields. To the Japanese, Pearl Harbor was an irresistibly easy target.The Japanese plan was simple: Destroy the Pacific Fleet. That way, the Americans would not be able to fight back as Japan’s armed forces spread across the South Pacific. On December 7, after months of planning and practice, the Japanese launched their attack. At about 8 a.m., Japanese planes filled the sky over Pearl Harbor. Bombs and bullets rained onto the vessels moored below. At 8:10, a 1,800-pound bomb smashed through the deck of the battleship USS Arizona and landed in her forward ammunition magazine. The ship exploded and sank with more than 1,000 men trapped inside. Next, torpedoes pierced the shell of the battleship USS Oklahoma. With 400 sailors aboard, the Oklahoma lost her balance, rolled onto her side and slipped underwater. Less than two hours later, the surprise attack was over, and every battleship in Pearl Harbor—USS Arizona, USS Oklahoma, USS California, USS West Virginia, USS Utah, USS Maryland, USS Pennsylvania, USS Tennessee and USS Nevada—had sustained significant damage. (All but USS Arizona and USS Utah were eventually salvaged and repaired.)", "pearl2"], ["In all, the Japanese attack on Pearl Harbor crippled or destroyed nearly 20 American ships and more than 300 airplanes. Dry docks and airfields were likewise destroyed. Most important, 2,403 sailors, soldiers and civilians were killed and about 1,000 people were wounded. But the Japanese had failed to cripple the Pacific Fleet. By the 1940s, battleships were no longer the most important naval vessel: Aircraft carriers were, and as it happened, all of the Pacific Fleet’s carriers were away from the base on December 7. (Some had returned to the mainland and others were delivering planes to troops on Midway and Wake Islands.) Moreover, the Pearl Harbor assault had left the base’s most vital onshore facilities—oil storage depots, repair shops, shipyards and submarine docks—intact. As a result, the U.S. Navy was able to rebound relatively quickly from the attack. President Franklin D. Roosevelt addressed a joint session of the U.S. Congress on December 8, the day after the crushing attack on Pearl Harbor. “Yesterday, December 7, 1941—a date which will live in infamy—the United States of America was suddenly and deliberately attacked by naval and air forces of the Empire of Japan.” He went on to say, “No matter how long it may take us to overcome this premeditated invasion, the American people in their righteous might will win through to absolute victory. I believe I interpret the will of the Congress and of the people when I assert that we will not only defend ourselves to the uttermost, but will make very certain that this form of treachery shall never endanger us again.” After the Pearl Harbor attack, and for the first time during years of discussion and debate, the American people were united in their determination to go to war. The Japanese had wanted to goad the United States into an agreement to lift the economic sanctions against them; instead, they had pushed their adversary into a global conflict that ultimately resulted in Japan’s first occupation by a foreign power.On December 8, Congress approved Roosevelt’s declaration of war on Japan. Three days later, Japan’s allies Germany and Italy declared war against the United States. For the second time, Congress reciprocated, declaring war on the European powers. More than two years after the start of World War II, the United States had entered the conflict.", "pearl3"]]
    },
    {
        "id" : 18,
        "EventName" : "Battle of Midway",
        "Date" : "June 4, 1942",
        "MajorEvent" : true,
        "lat" : 28.2072,
        "long" : 177.3735,
        "Location" : "Midway, Pacific Ocean",
        "Description" : [["One of Japan’s main goals during World War II was to remove the United States as a Pacific power in order to gain territory in east Asia and the southwest Pacific islands. Japan hoped to defeat the US Pacific Fleet and use Midway as a base to attack Pearl Harbor, securing dominance in the region and then forcing a negotiated peace. The United States was aware that the Japanese were planning an attack in the Pacific (on a location the Japanese code-named “AF”) because Navy cryptanalysts had begun breaking Japanese communication codes in early 1942. The attack location and time were confirmed when the American base at Midway sent out a false message that it was short of fresh water. Japan then sent a message that “AF” was short of fresh water, confirming that the location for the attack was the base at Midway. Station Hypo (where the cryptanalysts were based in Hawaii) was able to also give the date (June 4 or 5) and the order of battle of the Imperial Japanese Navy.", "midway1"], ["Early on the morning of June 4, aircraft from four Japanese aircraft carriers attacked and severely damaged the US base on Midway. Unbeknownst to the Japanese, the US carrier forces were just to the east of the island and ready for battle. After their initial attacks, the Japanese aircraft headed back to their carriers to rearm and refuel. While the aircraft were returning, the Japanese navy became aware of the presence of US naval forces in the area. TBD Devastator torpedo-bombers and SBD Dauntless dive-bombers from the USS Enterprise, USS Hornet, and USS Yorktown attacked the Japanese fleet. The Japanese carriers Akagi, Kaga, and Soryu were hit, set ablaze, and abandoned. Hiryu, the only surviving Japanese carrier, responded with two waves of attacks—both times bombing the USS Yorktown, leaving it severely damaged but still afloat. (A Japanese submarine later sank the Yorktown on June 7.) On the afternoon of June 4, a USS Yorktown scout plane located the Hiryu, and the Enterprise sent dive-bombers to attack. That attack left the Hiryu burning and without the ability to launch aircraft before it finally sank. Over the next two days, the US troops at sea and on Midway continued their attacks, forcing the Japanese to abandon the battle and retreat. The Japanese lost approximately 3,057 men, four carriers, one cruiser, and hundreds of aircraft, while the United States lost approximately 362 men, one carrier, one destroyer, and 144 aircraft. This critical US victory stopped the growth of Japan in the Pacific and put the United States in a position to begin shrinking the Japanese empire through a years-long series of island-hopping invasions and several even larger naval battles.", "midway2"]]
    },
    {
        "id" : 19,
        "EventName" : "Battle of Stalingrad",
        "Date" : "August 23, 1942",
        "MajorEvent" : true,
        "lat" : 48.7080,
        "long" : 44.5133,
        "Location" : "Stalingrad, Soviet Union",
        "Description" : [["The Battle of Stalingrad was a brutal military campaign between Russian forces and those of Nazi Germany and the Axis powers during World War II. The battle is infamous as one of the largest, longest and bloodiest engagements in modern warfare: From August 1942 through February 1943, more than two million troops fought in close quarters – and nearly two million people were killed or injured in the fighting, including tens of thousands of Russian civilians. But the Battle of Stalingrad (one of Russia’s important industrial cities) ultimately turned the tide of World War II in favor of the Allied forces. In the middle of World War II – having captured territory in much of present-day Ukraine and Belarus in the spring on 1942 – Germany’s Wehrmacht forces decided to mount an offensive on southern Russia in the summer of that year. Under the leadership of ruthless head of state Joseph Stalin, Russian forces had already successfully rebuffed a German attack on the western part of the country – one that had the ultimate goal of taking Moscow – during the winter of 1941-42. However, Stalin’s Red Army had suffered significant losses in the fighting, both in terms of manpower and weaponry. Stalin and his generals, including future Soviet Union leader Nikita Khrushchev, fully expected another Nazi attack to be aimed at Moscow. However, Hitler and the Wehrmacht had other ideas. They set their sights on Stalingrad, because the city served as an industrial center in Russia, producing, among other important goods, artillery for the country’s troops. The Volga River, which runs through the city, was also an important shipping route connecting the western part of the country with its distant eastern regions. Ultimately, Adolf Hitler wanted the Wehrmacht to occupy Stalingrad, seeing its value for propaganda purposes, given that it bore Stalin’s name. For similar reasons, the Russians felt a special need to protect it. When Hitler proclaimed that upon taking Stalingrad all of the city’s male residents would be killed and its women deported, the stage was set for a bloody, hard-fought battle. Stalin ordered all Russians strong enough to hold a rifle to take up arms in defense of the city. The 6th Army of the Wehrmacht began their assault on August 23, 1942.", "stalingrad1"], ["Russian forces were initially able to slow the German Wehrmacht’s advances during a series of brutal skirmishes just north of Stalingrad. Stalin’s forces lost more than 200,000 men, but they successfully held off German soldiers. With a firm understanding of Hitler’s plans, the Russians had already shipped much of the stores of grain and cattle out of Stalingrad. However, the city’s 400,000-plus residents were not evacuated, as the Russian leadership believed their presence would inspire troops. Within a few days of launching its attack, Germany’s Luftwaffe air force had rendered the Volga River impassable to shipping and had sunk several Russian commercial vessels in the process. From late August through the end of the assault, the Luftwaffe conducted dozens of air strikes on the city. The number of civilian casualties is unknown. However, it’s believed that tens of thousands were killed, and that tens of thousands more were captured and forced into slave labor in camps in Germany. By September, the Luftwaffe essentially had control of the skies over Stalingrad, and the Russians were getting desperate. Workers in the city not involved in war-related weapons production were soon asked to take up fighting, often without firearms of their own. Women were enlisted to dig trenches at the front lines. And yet, the Russians continued to suffer heavy losses. By the fall of 1942, Stalingrad was in ruins.", "stalingrad2"], ["Despite heavy casualties and the pounding delivered by the Luftwaffe, Stalin instructed his forces in the city to not retreat, famously decreeing in Order No. 227: “Not a step back!” Those who surrendered would be subject to a trial by military tribunal and face possible execution. With fewer than 20,000 troops in the city and less than 100 tanks, Stalin’s generals finally began sending reinforcements into the city and surrounding areas. Fighting raged in the streets of Stalingrad, with both sides using snipers poised on the roofs of the city’s buildings. Russian generals Georgy Zhukov and Aleksandr Vasilevsky organized Russian troops in the mountains to the north and west of the city. From there, they launched a counterattack, famously known as Operation Uranus. Although they again sustained significant losses, Russian forces were able to form what in essence was a defensive ring around the city by late November 1942, trapping the nearly 300,000 German and Axis troops in the 6th Army. This effort became the subject of a propaganda film produced after the war, The Battle of Stalingrad. With the Russian blockade limiting access to supplies, German forces trapped in Stalingrad slowly starved. The Russians would seize upon the resulting weakness during the cold, harsh winter months that followed.", "stalingrad3"], ["As Russia’s brutal winter began, Soviet generals knew the Germans would be at a disadvantage, fighting in conditions to which they weren’t accustomed. They began consolidating their positions around Stalingrad, choking off the German forces from vital supplies and essentially surrounding them in an ever-tightening noose. Thanks to Russian gains in nearby fighting, including in Rostov-on-Don, 250 miles from Stalingrad, the Axis forces – mostly Germans and Italians – were stretched thin. Through Operation Little Saturn, the Russians began to break the lines of mostly Italian forces to the west of the city. At this point, German generals abandoned all efforts to relieve their beleaguered forces trapped in Stalingrad. Still, Hitler refused to surrender even as his men slowly starved and ran out of ammunition. By February 1943, Russian troops had retaken Stalingrad and captured nearly 100,000 German soldiers, though pockets of resistance continued to fight in the city until early March. Most of the captured soldiers died in Russian prison camps, either as a result of disease or starvation. The loss at Stalingrad was the first failure of the war to be publicly acknowledged by Hitler. It put Hitler and the Axis powers on the defensive, and boosted Russian confidence as it continued to do battle on the Eastern Front in World War II. In the end, many historians believe the Battle at Stalingrad marked a major turning point in the conflict. It was the beginning of the march toward victory for the Allied forces of Russia, Britain, France and the United States. In February 2018, Russians gathered in what is now known as Volgograd to celebrate the 75th anniversary of the conclusion of the battle that had ravaged their city.", "stalingrad4"]]
    },
    {
        "id" : 20,
        "EventName" : "Solomon Islands Campaign",
        "Date" : "August 7, 1942",
        "MajorEvent" : false,
        "lat" : 0,
        "long" : 0,
        "Location" : "Guadalcanal, Solomon Islands",
        "Description" : [["Following its attack on Pearl Harbor (December 7, 1941), the Japanese Imperial Navy occupied islands throughout the western Pacific Ocean. Japan’s goal was to create a defensive buffer against attack from the United States and its allies—one that would ensure Japan mastery over east Asia and the southwest Pacific. After the US strategic victories at the Battles of the Coral Sea (May 7–8, 1942) and Midway (June 4–7, 1942), the Japanese Imperial Navy was no longer capable of major offensive campaigns, which permitted the Allies to start their own offensive in the Pacific. In August 1942, America mounted its first major amphibious landing of World War II at Guadalcanal, using innovative landing craft built by Higgins Industries in New Orleans. By seizing a strategic airfield site on the island, the United States halted Japanese efforts to disrupt supply routes to Australia and New Zealand. The invasion ignited a ferocious struggle marked by seven major naval battles, numerous clashes ashore, and almost continuous air combat. For six long months US forces fought to hold the island. In the end they prevailed, and the Allies took the first vital step in driving the Japanese back in the Pacific theater.", "guad1"], ["American forces first landed on the Solomon Islands of Guadalcanal, Tulagi, and Florida on the morning of August 7,1942. After some fierce fighting, the US Marines cleared Tulagi and Florida by August 9. The main forces on Guadalcanal met little resistance on their way inland to secure the airfield at Lunga Point, which was soon renamed Henderson Field after Loy Henderson, an aviator killed at the Battle of Midway. Almost immediately, however, Japanese naval aircraft attacked transport and escort ships, and Japanese reinforcements arrived in the area. Over the following days, the first of many deadly naval battles occurred—the Naval Battle of Savo Island. The fight for control of Guadalcanal, its critical airfield, and the seas around them continued for months with both sides losing men, ships, and aircraft and with neither side able to drive the other off the island. During the first amphibious invasion in the Pacific, the United States made many initial mistakes, including not having the proper resources on the beaches to move men and matériel inland. The logistical challenges of transport and supply across the Pacific were also immense. Difficult jungle terrain, inhospitable weather, lack of infrastructure, and a foe that fought to the death gave the United States its first taste of what was to come throughout the Pacific war. It seemed that every time the United States inched closer to victory, the Japanese would resupply Guadalcanal by night and be ready for more fighting the next day.", "guad2"], ["Determined to achieve a decisive victory, Japanese forces massed for an all-out attack in October 1942. Meanwhile, the Marines finally began receiving fresh reinforcements, including soldiers from the US Army. The Americans strengthened their defenses at Henderson Field and launched aggressive jabs to keep the Japanese off-balance. When the Japanese Seventeenth Army launched the assault on October 23, 1942, striking at multiple points along the airfield perimeter over four days, tenacious fighting by US Marines and soldiers threw back the attacks. American losses were significant, but Japanese losses were devastating. The battle at sea also heated up in the fall of 1942. On October 26, American and Japanese naval forces clashed off the Santa Cruz Islands. Japan secured a tactical victory, sinking the carrier Hornet, but paid a severe price in aircraft and skilled aircrew. Then from November 12–15, in the frantic Naval Battle of Guadalcanal, American sailors and airmen blocked Japan’s last effort to knock out Henderson Field from the sea, at heavy cost. As one Japanese officer noted, “This was the fork in the road.” While fighting continued on the island, the Japanese withdrew their final men and left the island to the Allies in February 1943. The Solomon Islands Campaign cost the Allies approximately 7,100 men, 29 ships, and 615 aircraft. The Japanese lost 31,000 men, 38 ships, and 683 aircraft. Over the next two and a half years, US forces captured the Gilbert Islands (Tarawa and Makin), the Marshall Islands (Kwajalein and Eniwetok), the Mariana Islands (Saipan, Guam, and Tinian), Iwo Jima, and Okinawa. With each island taken from the Japanese, the United States moved closer to Japan. Growing superiority at sea and in the air, as well as in the number of fighting men, gave the United States increasing advantages. Nonetheless, wherever US forces met Japanese defenders, the enemy fought long and hard before being defeated.", "guad3"]]
    },
    {
        "id" : 21,
        "EventName" : "Battle of El-Alamein",
        "Date" : "October 23, 1942",
        "MajorEvent" : true,
        "lat" : 30.8225,
        "long" : 28.9543,
        "Location" : "El-Alamein, Egypt",
        "Description" : [["Conflict in North Africa had been ignited in 1940 by Italy’s invasion of Egypt from its colony of Libya. This threatened Britain’s vital strategic assets, the Suez Canal and Persian oil fields. However, when the Italians were defeated, Germany intervened on behalf of its ally in the spring of 1941. Under the bold leadership of General Rommel, the Axis enjoyed startling successes, recapturing Libya and threatening Egypt. Yet, by late 1941, when Rommel’s forces had overstretched their supply lines, they were forced to fall back in the face of a determined British offensive. In 1942 a revived Axis effort saw Rommel defeat the British at Gazala and capture Tobruk. For a while it seemed that Rommel would link up with the Germans advancing in the Caucasus and so overrun the whole Middle East. The British conducted a chaotic retreat into Egypt, but rallied their battered army and made a stand at the First Battle of El Alamein. This was a position that, unlike others in the desert, could not be turned by a flanking manoeuvre. It bordered both the sea and the Qattara Depression, a sea of quicksand impassable to mechanised forces. The summer of 1942 saw the defeat of Rommel’s final efforts to breakthrough into Egypt. The initiative now lay with the British. They planned another offensive that would finally end the Axis threat to the Middle East.", "el1"], ["Lieutenant-General Bernard Law Montgomery (1887-1976) was one of the most capable and controversial British commanders. In August 1942 he was appointed Eighth Army's commander and immediately set about transforming its fighting spirit. At Alamein he commanded over 190,000 men from across the British Empire, Greece, Poland and France. They were equipped with over 1,000 tanks, 900 artillery pieces and 1,400 anti-tank guns. Field Marshal Erwin Rommel (1891-1944) was already famous for his brilliant generalship during the battles for France and North Africa. Rommel was a master of desert warfare, earning the nickname ‘Desert Fox’. Exuding frenetic energy and leading from the front, he inspired his troops to great feats of heroism and endurance. His instinct for handling armoured formations, combined with the qualitative superiority of German units, enabled the ‘Afrikakorps’ to consistently outmatch the Allies, often against heavy odds. At Alamein he commanded 116,000 German and Italian soldiers, 540 tanks, 500 artillery pieces and 490 anti-tank guns.", "el2"], ["The Axis forces were once more in a critical supply situation. Lacking the fuel and mechanised forces to fight a mobile battle Rommel instead constructed strong defensive positions protected by deep minefields, which he nicknamed the ‘devil’s gardens’. Realising the strength of the Axis defences, Montgomery resisted the impatient pleas of British Prime Minister Winston Churchill for an early attack. Instead he set about building up his forces, improving the morale and training of his troops, ensuring that he had superior numbers of men, tanks, guns and aircraft. Having assembled a powerful multinational Allied force, Montgomery unleashed his offensive on the night of 23 October with a spectacular artillery barrage. In the early hours of 24 October British infantry and engineers began Operation Lightfoot, a painstaking and hazardous process of creating two channels in the minefields, through which the armoured forces were to advance. The British then established a forward line from where the Axis forces would be engaged and worn down. This battle of attrition, euphemistically termed ‘crumbling’ by Montgomery, involved brutal close-quarter fighting in which the soldiers were tested in a maelstrom of heat, noise and horror. While they were able to beat off Axis counter-attacks, British efforts were hampered as their tanks were held up in the congested minefield corridors and suffered punishing losses from enemy anti-tank guns. Despite the difficulties, Montgomery held his nerve. He pressed home the attrition of the enemy forces and launching a diversionary attack to draw in scarce Axis reserves. He then paused and regrouped before launching his final attack, codenamed Operation Supercharge, on the night of 1-2 November. After several more days of severe fighting the British achieved a decisive breakthrough on 4 November. While the British captured the bulk of the Axis infantry, Montgomery’s caution allowed the motorised portion to escape and live to fight another day. Nevertheless, the British had won a remarkable victory and Montgomery began pursuing his beaten foe back into Libya and Tunisia.", "el3"], ["El Alamein was the first clear-cut and irreversible victory inflicted by the British Army upon the Axis. Coming after years of frustrating setbacks, this was a boost to British morale. Victory proved that the problems that had plagued the Army for years had at last been overcome and that its equipment, tactics, generalship and fighting spirit were a match for the Axis. For Churchill, the victory was vital for re-establishing British prestige before America reduced Britain to the role of junior partner in the western alliance. This was why he had been so anxious to instigate the battle before Operation Torch, the Allied landings on the coast of Algeria and Morocco, began.The landings began on 8 November and forced the Axis to fight on two fronts. With the Allies also prevailing in the naval and air wars raging in the Mediterranean, the Axis position in North Africa was now untenable. Despite this, Hitler belatedly ordered a massive re-enforcement, which enabled the Axis to fight a defensive campaign in Tunisia into 1943. Although they fought a tenacious rearguard, the Axis forces were in an impossible position and in May were forced to surrender, with the loss of around 240,000 prisoners. Aided by Churchill’s rhetoric, which extolled it as ‘the end of the beginning’ of the war, El Alamein has become enshrined in British mythology as a great strategic turning point of the war. This may be an overstatement given that North Africa was only a sideshow compared to the titanic battles waged on the Eastern and Western Fronts. However, the battle boosted national morale and became one of the most celebrated victories of the war. Alamein also established the reputation of Montgomery. Using his talent for self-publicity, he claimed all the credit for the victory. This made him a household name and secured him prestigious commands in Italy and North-West Europe. While he was able to cement his image as a national hero, Montgomery’s conduct during the battle remains the subject of debate.", "el4"]]
    },
    {
        "id" : 22,
        "EventName" : "Allied Invasion of Italy",
        "Date" : "September 23, 1943",
        "MajorEvent" : true,
        "lat" : 37.6000,
        "long" : 14.0154,
        "Location" : "Sicily, Italy",
        "Description" : [["The British 8th Army under Field Marshal Bernard L. Montgomery begins the Allied invasion of the Italian peninsula, crossing the Strait of Messina from Sicily and landing at Calabria–the “toe” of Italy. On the day of the landing, the Italian government secretly agreed to the Allies’ terms for surrender, but no public announcement was made until September 8. Italian dictator Benito Mussolini envisioned building Fascist Italy into a new Roman Empire, but a string of military defeats in World War II effectively made his regime a puppet of its stronger Axis partner, Germany. By the spring of 1943, opposition groups in Italy were uniting to overthrow Mussolini and make peace with the Allies, but a strong German military presence in Italy threatened to resist any such action. On July 10, 1943, the Allies began their invasion of Axis-controlled Europe with landings on the island of Sicily, off mainland Italy. Encountering little resistance from demoralized Sicilian troops, Montgomery’s 8th Army came ashore on the southeast part of the island, while the U.S. 7th Army, under General George S. Patton, landed on Sicily’s south coast. Within three days, 150,000 Allied troops were ashore. On August 17, Patton arrived in Messina before Montgomery, completing the Allied conquest of Sicily and winning the so-called Race to Messina.", "ii1"], ["In Rome, the Allied conquest of Sicily, a region of the kingdom of Italy since 1860, led to the collapse of Mussolini’s government. Early in the morning of July 25, he was forced to resign by the Fascist Grand Council and was arrested later that day. On July 26, Marshal Pietro Badoglio assumed control of the Italian government. The new government promptly entered into secret negotiations with the Allies, despite the presence of numerous German troops in Italy. On September 3, Montgomery’s 8th Army began its invasion of the Italian mainland and the Italian government agreed to surrender to the Allies. By the terms of the agreement, the Italians would be treated with leniency if they aided the Allies in expelling the Germans from Italy. Later that month, Mussolini was rescued from a prison in the Abruzzo Mountains by German commandos and was installed as leader of a Nazi puppet state in northern Italy. In October, the Badoglio government declared war on Germany, but the Allied advance up through Italy proved to be a slow and costly affair. Rome fell in June 1944, at which point a stalemate ensued as British and American forces threw most of their resources into the Normandy invasion. In April 1945, a new major offensive began, and on April 28 Mussolini was captured by Italian partisans and summarily executed. German forces in Italy surrendered on May 1, and six days later all of Germany surrendered.", "ii2"]]
    },
    {
        "id" : 23,
        "EventName" : "Normandy Landings",
        "Date" : "June 6, 1944",
        "MajorEvent" : true,
        "lat" : 48.8799,
        "long" : 0.1713,
        "Location" : "Normandy, France",
        "Description" : [["During World War II (1939-1945), the Battle of Normandy, which lasted from June 1944 to August 1944, resulted in the Allied liberation of Western Europe from Nazi Germany’s control. Codenamed Operation Overlord, the battle began on June 6, 1944, also known as D-Day, when some 156,000 American, British and Canadian forces landed on five beaches along a 50-mile stretch of the heavily fortified coast of France’s Normandy region. The invasion was one of the largest amphibious military assaults in history and required extensive planning. Prior to D-Day, the Allies conducted a large-scale deception campaign designed to mislead the Germans about the intended invasion target. By late August 1944, all of northern France had been liberated, and by the following spring the Allies had defeated the Germans. The Normandy landings have been called the beginning of the end of war in Europe. After World War II began, Germany invaded and occupied northwestern France beginning in May 1940. The Americans entered the war in December 1941, and by 1942 they and the British (who had been evacuated from the beaches of Dunkirk in May 1940 after being cut off by the Germans in the Battle of France) were considering the possibility of a major Allied invasion across the English Channel. The following year, Allied plans for a cross-Channel invasion began to ramp up. In November 1943, Adolf Hitler (1889-1945), who was aware of the threat of an invasion along France’s northern coast, put Erwin Rommel (1891-1944) in charge of spearheading defense operations in the region, even though the Germans did not know exactly where the Allies would strike. Hitler charged Rommel with finishing the Atlantic Wall, a 2,400-mile fortification of bunkers, landmines and beach and water obstacles. In January 1944, General Dwight Eisenhower (1890-1969) was appointed commander of Operation Overlord. In the months and weeks before D-Day, the Allies carried out a massive deception operation intended to make the Germans think the main invasion target was Pas-de-Calais (the narrowest point between Britain and France) rather than Normandy. In addition, they led the Germans to believe that Norway and other locations were also potential invasion targets. Many tactics were used to carry out the deception, including fake equipment; a phantom army commanded by George Patton and supposedly based in England, across from Pas-de-Calais; double agents; and fraudulent radio transmissions.", "norman1"], ["Eisenhower selected June 5, 1944, as the date for the invasion; however, bad weather on the days leading up to the operation caused it to be delayed for 24 hours. On the morning of June 5, after his meteorologist predicted improved conditions for the following day, Eisenhower gave the go-ahead for Operation Overlord. He told the troops: “You are about to embark upon the Great Crusade, toward which we have striven these many months. The eyes of the world are upon you.” Later that day, more than 5,000 ships and landing craft carrying troops and supplies left England for the trip across the Channel to France, while more than 11,000 aircraft were mobilized to provide air cover and support for the invasion. By dawn on June 6, thousands of paratroopers and glider troops were already on the ground behind enemy lines, securing bridges and exit roads. The amphibious invasions began at 6:30 a.m. The British and Canadians overcame light opposition to capture beaches codenamed Gold, Juno and Sword, as did the Americans at Utah Beach. U.S. forces faced heavy resistance at Omaha Beach, where there were over 2,000 American casualties. However, by day’s end, approximately 156,000 Allied troops had successfully stormed Normandy’s beaches. According to some estimates, more than 4,000 Allied troops lost their lives in the D-Day invasion, with thousands more wounded or missing. Less than a week later, on June 11, the beaches were fully secured and over 326,000 troops, more than 50,000 vehicles and some 100,000 tons of equipment had landed at Normandy. For their part, the Germans suffered from confusion in the ranks and the absence of celebrated commander Rommel, who was away on leave. At first, Hitler, believing the invasion was a feint designed to distract the Germans from a coming attack north of the Seine River, refused to release nearby divisions to join the counterattack. Reinforcements had to be called from further afield, causing delays. He also hesitated in calling for armored divisions to help in the defense. Moreover, the Germans were hampered by effective Allied air support, which took out many key bridges and forced the Germans to take long detours, as well as efficient Allied naval support, which helped protect advancing Allied troops.", "norman2"], ["In the ensuing weeks, the Allies fought their way across the Normandy countryside in the face of determined German resistance, as well as a dense landscape of marshes and hedgerows. By the end of June, the Allies had seized the vital port of Cherbourg, landed approximately 850,000 men and 150,000 vehicles in Normandy, and were poised to continue their march across France.  By the end of August 1944, the Allies had reached the Seine River, Paris was liberated and the Germans had been removed from northwestern France, effectively concluding the Battle of Normandy. The Allied forces then prepared to enter Germany, where they would meet up with Soviet troops moving in from the east. The Normandy invasion began to turn the tide against the Nazis. A significant psychological blow, it also prevented Hitler from sending troops from France to build up his Eastern Front against the advancing Soviets. The following spring, on May 8, 1945, the Allies formally accepted the unconditional surrender of Nazi Germany. Hitler had committed suicide a week earlier, on April 30.", "norman3"]]
    },
    {
        "id" : 24,
        "EventName" : "Russian Counterattack",
        "Date" : "June 22, 1944",
        "MajorEvent" : false,
        "lat" : 0,
        "long" : 0,
        "Location" : "Eastern Belarus",
        "Description" : [["In Apr 1944, Soviet leaders selected a plan to attack the German Group Center holding a bulge in Byelorussia and Ukraine. Knowing that to defeat such a concentration of German forces, the magnitude of Soviet preparations would alarm the German forces, therefore a deceptive operation was also planned to throw off the Germans. On 17 Apr the first deceptive tactic was employed to prepare for Bagration, which was to switch the entire Soviet front to a defensive mode by ceasing major offensives and to construct (sometimes false) defensive structures. Later, when the Soviet forces in the area could mean nothing but an assault, Soviet forces started to spread false intelligence that the offensive was to be made against Army Group South in Ukraine, reinforcing something that the German originally expected. When the operation launched, 1st and 3rd Ukrainian Armies in Ukraine were deployed to further support that misconception. ww2dbaseThe Germans fell for the deceptions. In fact, the Germans interpreted the deceptive events in such depth that they actually made further maneuvers to make Army Group Center weaker; for instance, most armor in the German reserves were transferred to northern Ukraine, leaving Army Group Center in the north without proper reinforcements. Other factors such as the reaction to the western Allies' Normandy invasion also weakened the available forces on the Soviet front for the Germans.", "sca1"], ["The actual Bagration offensive began in the morning of 22 Jun 1944 with 1,700,000 Soviet troops and 6,000 armor rushing against 34 surprised German divisions, nearly achieving a 10-to-1 numerical advantage with armor and 7-to-1 with aircraft. The German lines fell apart quickly, and Minsk fell under Soviet control on 3 Jul, capturing 50,000 prisoners of war. Ten days later, Soviet troops reached the Polish border. By the end of Jul 1944, the entire Army Group Center ceased to exist, losing 300,000 men to death and 120,000 to capture. Over 2,000 tanks were lost as well. On the Soviet side, 60,000 were killed and nearly 3,000 tanks were lost. This was one of the very few major battles on the Soviet fronts where the Soviets suffered fewer casualties than the Germans. With Army Group Center completely wiped out, the German forces not only suffered a major defeat, but without Byelorussia the supply lines to Army Group North were also lost. ww2dbaseOn 17 Jul, an offensive was launched against the German forces in Ukraine to leverage the victory in Byelorussia. This successful sister campaign to Bagration paved a way for Soviet troops to enter German-controlled Balkans. With the Soviet forces established in Ukraine, Romanians overthrew the dictator Ion Antonescu and switched sides to fight on the side of the Soviets. Across Romania's southern border, Bulgaria surrendered to Russia on 9 Sep, similarly declaring war on Germany upon its surrender. ww2dbaseAfter WW2, Operation Bagration's deceptive operations became a model taught to Soviet Army cadets.", "sca2"]]
    },
    {
        "id" : 25,
        "EventName" : "Liberation of Paris",
        "Date" : "August 20, 1944",
        "MajorEvent" : true,
        "lat" : 48.8566,
        "long" : 2.3522,
        "Location" : "Paris, France",
        "Description" : [["After more than four years of Nazi occupation, Paris is liberated by the French 2nd Armored Division and the U.S. 4th Infantry Division. German resistance was light, and General Dietrich von Choltitz, commander of the German garrison, defied an order by Adolf Hitler to blow up Paris’ landmarks and burn the city to the ground before its liberation. Choltitz signed a formal surrender that afternoon, and on August 26, Free French General Charles de Gaulle led a joyous liberation march down the Champs d’Elysees. Paris fell to Nazi Germany on June 14, 1940, one month after the German Wehrmacht stormed into France. Eight days later, France signed an armistice with the Germans, and a puppet French state was set up with its capital at Vichy. Elsewhere, however, General Charles de Gaulle and the Free French kept fighting, and the Resistance sprang up in occupied France to resist Nazi and Vichy rule. The French 2nd Armored Division was formed in London in late 1943 with the express purpose of leading the liberation of Paris during the Allied invasion of France. In August 1944, the division arrived at Normandy under the command of General Jacques-Philippe Leclerc and was attached to General George S. Patton’s 3rd U.S. Army. By August 18, Allied forces were near Paris, and workers in the city went on strike as Resistance fighters emerged from hiding and began attacking German forces and fortifications. At his headquarters two miles inland from the Normandy coast, Supreme Allied Commander Dwight D. Eisenhower had a dilemma. Allied planners had concluded that the liberation of Paris should be delayed so as to not divert valuable resources away from important operations elsewhere. The city could be encircled and then liberated at a later date.", "paris1"], ["On August 21, Eisenhower met with de Gaulle and told him of his plans to bypass Paris. De Gaulle urged him to reconsider, assuring him that Paris could be reclaimed without difficulty. The French general also warned that the powerful communist faction of the Resistance might succeed in liberating Paris, thereby threatening the re-establishment of a democratic government. De Gaulle politely told Eisenhower that if his advance against Paris was not ordered, he would send Leclerc’s 2nd Armored Division into the city himself. On August 22, Eisenhower agreed to proceed with the liberation of Paris. The next day, the 2nd Armored Division advanced on the city from the north and the 4th Infantry Division from the south. Meanwhile, in Paris, the forces of German General Dietrich von Choltitz were fighting the Resistance and completing their defenses around the city. Hitler had ordered Paris defended to the last man, and demanded that the city not fall into Allied hands except as “a field of ruins.” Choltitz dutifully began laying explosives under Paris’ bridges and many of its landmarks, but disobeyed an order to commence the destruction. He did not want to go down in history as the man who had destroyed the “City of Light”—Europe’s most celebrated city. The 2nd Armored Division ran into heavy German artillery, taking heavy casualties, but on August 24 managed to cross the Seine and reach the Paris suburbs. There, they were greeted by enthusiastic civilians who besieged them with flowers, kisses, and wine. Later that day, Leclerc learned that the 4th Infantry Division was poised to beat him into Paris proper, and he ordered his exhausted men forward in a final burst of energy. Just before midnight on August 24, the 2nd Armored Division reached the Hótel de Ville in the heart of Paris. German resistance melted away during the night. Most of the 20,000 troops surrendered or fled, and those that fought were quickly overcome. On the morning of August 25, the 2nd Armored Division swept clear the western half of Paris while the 4th Infantry Division cleared the eastern part. Paris was liberated. In the early afternoon, Choltitz was arrested in his headquarters by French troops. Shortly after, he signed a document formally surrendering Paris to de Gaulle’s provisional government. De Gaulle himself arrived in the city later that afternoon. On August 26, de Gaulle and Leclerc led a triumphant liberation march down the Champs d’Elysees. Scattered gunfire from a rooftop disrupted the parade, but the identity of the snipers was not determined. De Gaulle headed two successive French provisional governments until 1946, when he resigned over constitutional disagreements. From 1958 to 1969, he served as French president under the Fifth Republic.", "paris2"]]
    },
    {
        "id" : 26,
        "EventName" : "Battle of the Bulge",
        "Date" : "December 16, 1944",
        "MajorEvent" : false,
        "lat" : 0,
        "long" : 0,
        "Location" : "Ardennes, France",
        "Description" : [["In late 1944, during the wake of the Allied forces' successful D-Day invasion of Normandy, France, it seemed as if the Second World War was all but over. On Dec. 16, with the onset of winter, the German army launched a counteroffensive that was intended to cut through the Allied forces in a manner that would turn the tide of the war in Hitler's favor. The battle that ensued is known historically as the Battle of the Bulge. The courage and fortitude of the American Soldier was tested against great adversity. Nevertheless, the quality of his response ultimately meant the victory of freedom over tyranny. Early on the misty winter morning of Dec. 16, 1944, more than 200,000 German troops and nearly 1,000 tanks launched Adolf Hitler's last bid to reverse the ebb in his fortunes that had begun when Allied troops landed in France on D-Day. Seeking to drive to the coast of the English Channel and split the Allied armies as they had done in May 1940, the Germans struck in the Ardennes Forest, a 75-mile stretch of the front characterized by dense woods and few roads, held by four inexperienced and battle-worn American divisions stationed there for rest and seasoning. After a day of hard fighting, the Germans broke through the American front, surrounding most of an infantry division, seizing key crossroads, and advancing their spearheads toward the Meuse River, creating the projection that gave the battle its name.", "bulge1"], ["Stories spread of the massacre of Soldiers and civilians at Malmedy and Stavelot, of paratroopers dropping behind the lines, and of English-speaking German soldiers, disguised as Americans, capturing critical bridges, cutting communications lines, and spreading rumors. For those who had lived through 1940, the picture was all too familiar. Belgian townspeople put away their Allied flags and brought out their swastikas. Police in Paris enforced an all-night curfew. British veterans waited nervously to see how the Americans would react to a full-scale German offensive, and British generals quietly acted to safeguard the Meuse River's crossings. Even American civilians, who had thought final victory was near were sobered by the Nazi onslaught. But this was not 1940. The supreme Allied commander, Gen. Dwight D. Eisenhower rushed reinforcements to hold the shoulders of the German penetration. Within days, Lt. Gen. George S. Patton Jr. had turned his Third U.S. Army to the north and was counterattacking against the German flank. But the story of the Battle of the Bulge is above all the story of American Soldiers. Often isolated and unaware of the overall picture, they did their part to slow the Nazi advance, whether by delaying armored spearheads with obstinate defenses of vital crossroads, moving or burning critical gasoline stocks to keep them from the fuel-hungry German tanks, or coming up with questions on arcane Americana to stump possible Nazi infiltrators.At the critical road junctions of St. Vith and Bastogne, American tankers and paratroopers fought off repeated attacks, and when the acting commander of the 101st Airborne Division in Bastogne was summoned by his German adversary to surrender, he simply responded, 'Nuts!' Within days, Patton's Third Army had relieved Bastogne, and to the north, the 2nd U.S. Armored Division stopped enemy tanks short of the Meuse River on Christmas. Through January, American troops, often wading through deep snow drifts, attacked the sides of the shrinking bulge until they had restored the front and set the stage for the final drive to victory.Never again would Hitler be able to launch an offensive in the west on such a scale. An admiring British Prime Minister Sir Winston Churchill stated, 'This is undoubtedly the greatest American battle of the war and will, I believe, be regarded as an ever-famous American victory.' Indeed, in terms of participation and losses, the Battle of the Bulge is arguably the greatest battle in American military history.", "bulge2"]]
    },
    {
        "id" : 27,
        "EventName" : "Soviets Encircle Berlin, Germany Surrenders",
        "Date" : "May 9, 1945",
        "MajorEvent" : true,
        "lat" : 52.5200,
        "long" : 13.4050,
        "Location" : "Berlin, Germany",
        "Description" : [["The Battle of Berlin, designated as the Berlin Strategic Offensive Operation by the Soviet Union, and also known as the Fall of Berlin, was one of the last major offensives of the European theatre of World War II. Following the Vistula–Oder Offensive of January–February 1945, the Red Army had temporarily halted on a line 60 km (37 mi) east of Berlin. On 9 March, Germany established its defence plan for the city with Operation Clausewitz. The first defensive preparations at the outskirts of Berlin were made on 20 March, under the newly appointed commander of Army Group Vistula, General Gotthard Heinrici. When the Soviet offensive resumed on 16 April, two Soviet fronts (army groups) attacked Berlin from the east and south, while a third overran German forces positioned north of Berlin. Before the main battle in Berlin commenced, the Red Army encircled the city after successful battles of the Seelow Heights and Halbe. On 20 April 1945, Hitler's birthday, the 1st Belorussian Front led by Marshal Georgy Zhukov, advancing from the east and north, started shelling Berlin's city centre, while Marshal Ivan Konev's 1st Ukrainian Front broke through Army Group Centre and advanced towards the southern suburbs of Berlin. On 23 April General Helmuth Weidling assumed command of the forces within Berlin. The garrison consisted of several depleted and disorganised Wehrmacht and Waffen-SS divisions, along with poorly trained Volkssturm and Hitler Youth members. Over the course of the next week, the Red Army gradually took the entire city. On 30 April, Hitler committed suicide (with several of his officials also committing suicide shortly afterwards). The city's garrison surrendered on 2 May but fighting continued to the north-west, west, and south-west of the city until the end of the war in Europe on 8 May (9 May in the Soviet Union) as some German units fought westward so that they could surrender to the Western Allies rather than to the Soviets.", "sur1"], ["Although at the time of the surrender virtually all of Germany was under Allied control, German forces still occupied western Netherlands, Denmark, much of Norway, as well as western and central Czechoslovakia. German and Russian troops fought on in the East for most of the next day. Initially, following instructions from Grand Adm. Karl Donitz, Hitler’s successor, Jodl offered to surrender all forces fighting the Western Allies. Gen. Dwight D. Eisenhower, the Supreme Allied Commander, threatened to break off negotiations unless the Germans agreed to a complete unconditional surrender to all the Allies on all fronts. Eisenhower told Jodl that he would order western lines closed to German soldiers, thus forcing them to surrender to the advancing Soviets on the Eastern Front. Jodl sent a radio signal to Donitz in Flensburg, a remaining enclave on the Danish border, informing him of Eisenhower's ultimatum. Shortly after midnight, Donitz sent a signal to Jodl authorizing the complete and total surrender of all German forces.", "sur2"], ["Gen. Walter Bedell Smith, Eisenhower’s chief of staff, signed for SHAEF while French Gen. Francois Sevez and Soviet Major Gen. Ivan Susloparov signed as witnesses. The Kremlin called for a second four-power surrender ceremony, which took place May 8 in a former German Army engineering school in the Berlin district of Karlshorst. (It now houses the German-Russian Museum Berlin-Karlshorst.) May 8 was declared Victory-in-Europe (V-E) Day, a day still celebrated as a public holiday in some European countries, including Russia. Though not one of the conspirators, Jodl had been injured in the assassination attempt on Hitler in 1944. An Allied tribunal sitting in Nuremberg found him guilty of war crimes. He was hanged on Oct. 16, 1946. In 1953, a German appeals court found Jodl not guilty and granted him a posthumous pardon. President Harry S. Truman proclaimed a formal cessation of hostilities between the United States and Germany on Dec. 13, 1946. A conference in Paris, held in February 1947, ended with the signing of peace treaties with Italy, Romania, Hungary, Bulgaria and Finland, countries that at various times during the war had aligned themselves with Nazi Germany as the Axis Powers. The Allied military occupation of West German territory formally ended on May 5, 1955, with the recognition of the Federal Republic of Germany as having “the full authority of a sovereign state.” That treaty ended the military occupation of West German territory, although the three Western occupying powers — the United States, Great Britain, and France — retained their military rights in West Berlin until 1994.", "sur3"]]
    },
    {
        "id" : 28,
        "EventName" : "US Drops Nuclear Bomb on Hiroshima and Nagasaki",
        "Date" : "August 6, 1945",
        "MajorEvent" : true,
        "lat" : 34.3853,
        "long" : 132.4553,
        "Location" : "Hiroshima, Japan",
        "Description" : [["On August 6, 1945, the United States becomes the first and only nation to use atomic weaponry during wartime when it drops an atomic bomb on the Japanese city of Hiroshima. Approximately 80,000 people are killed as a direct result of the blast, and another 35,000 are injured. At least another 60,000 would be dead by the end of the year from the effects of the fallout. Though the dropping of the atomic bomb on Japan marked the end of World War II, many historians argue that it also ignited the Cold War. Since 1940, the United States had been working on developing an atomic weapon, after having been warned that Nazi Germany was already conducting research into nuclear weapons. By the time the United States conducted the first successful test (an atomic bomb was exploded in the desert in New Mexico in July 1945), Germany had already been defeated. The war against Japan in the Pacific, however, continued to rage. President Harry S. Truman, warned by some of his advisers that any attempt to invade Japan would result in horrific American casualties, ordered that the new weapon be used to bring the war to a speedy end. On August 6, 1945, the American bomber Enola Gay dropped a five-ton bomb over the Japanese city of Hiroshima. A blast equivalent to the power of 15,000 tons of TNT reduced four square miles of the city to ruins and immediately killed 80,000 people. Tens of thousands more died in the following weeks from wounds and radiation poisoning. Three days later, another bomb was dropped on the city of Nagasaki, killing nearly 40,000 more people. A few days later, Japan announced its surrender.", "atom1"], ["In the years since the two atomic bombs were dropped on Japan, a number of historians have suggested that the weapons had a two-pronged objective. First, of course, was to bring the war with Japan to a speedy end and spare American lives. It has been suggested that the second objective was to demonstrate the new weapon of mass destruction to the Soviet Union. By August 1945, relations between the Soviet Union and the United States had deteriorated badly. The Potsdam Conference between U.S. President Harry S. Truman, Russian leader Joseph Stalin, and Winston Churchill (before being replaced by Clement Attlee) ended just four days before the bombing of Hiroshima. The meeting was marked by recriminations and suspicion between the Americans and Soviets. Russian armies were occupying most of Eastern Europe. Truman and many of his advisers hoped that the U.S. atomic monopoly might offer diplomatic leverage with the Soviets. In this fashion, the dropping of the atomic bomb on Japan can be seen as the first shot of the Cold War. If U.S. officials truly believed that they could use their atomic monopoly for diplomatic advantage, they had little time to put their plan into action. By 1949, the Soviets had developed their own atomic bomb and the nuclear arms race began.", "atom2"]]
    },
    {
        "id" : 29,
        "EventName" : "Japan Surrenders to Allies, WW2 Ends",
        "Date" : "September 2, 1945",
        "MajorEvent" : true,
        "lat" : 35.2117,
        "long" : 139.4536,
        "Location" : "USS Misouri, Pacific Ocean",
        "Description" : [["Aboard the USS Missouri in Tokyo Bay, Japan formally surrenders to the Allies, bringing an end to World War II. By the summer of 1945, the defeat of Japan was a foregone conclusion. The Japanese navy and air force were destroyed. The Allied naval blockade of Japan and intensive bombing of Japanese cities had left the country and its economy devastated. At the end of June, the Americans captured Okinawa, a Japanese island from which the Allies could launch an invasion of the main Japanese home islands. U.S. General Douglas MacArthur was put in charge of the invasion, which was code-named “Operation Olympic” and set for November 1945. The invasion of Japan promised to be the bloodiest seaborne attack of all time, conceivably 10 times as costly as the Normandy invasion in terms of Allied casualties. On July 16, a new option became available when the United States secretly detonated the world’s first atomic bomb in the New Mexico desert. Ten days later, the Allies issued the Potsdam Declaration, demanding the “unconditional surrender of all the Japanese armed forces.” Failure to comply would mean “the inevitable and complete destruction of the Japanese armed forces and just as inevitable the utter devastation of the Japanese homeland.” On July 28, Japanese Prime Minister Kantaro Suzuki responded by telling the press that his government was “paying no attention” to the Allied ultimatum. U.S. President Harry S. Truman ordered the devastation to proceed, and on August 6, the U.S. B-29 bomber Enola Gay dropped an atomic bomb on the Japanese city of Hiroshima, killing an estimated 80,000 people and fatally wounding thousands more.", "end1"], ["After the Hiroshima attack, a faction of Japan’s supreme war council favored acceptance of the Potsdam Declaration, but the majority resisted unconditional surrender. On August 8, Japan’s desperate situation took another turn for the worse when the USSR declared war against Japan. The next day, Soviet forces attacked in Manchuria, rapidly overwhelming Japanese positions there, and a second U.S. atomic bomb was dropped on the Japanese coastal city of Nagasaki. Just before midnight on August 9, Japanese Emperor Hirohito convened the supreme war council. After a long, emotional debate, he backed a proposal by Prime Minister Suzuki in which Japan would accept the Potsdam Declaration “with the understanding that said Declaration does not compromise any demand that prejudices the prerogatives of His Majesty as the sovereign ruler.” The council obeyed Hirohito’s acceptance of peace, and on August 10 the message was relayed to the United States. Early on August 12, the United States answered that “the authority of the emperor and the Japanese government to rule the state shall be subject to the Supreme Commander of the Allied Powers.” After two days of debate about what this statement implied, Emperor Hirohito brushed the nuances in the text aside and declared that peace was preferable to destruction. He ordered the Japanese government to prepare a text accepting surrender. In the early hours of August 15, a military coup was attempted by a faction led by Major Kenji Hatanaka. The rebels seized control of the imperial palace and burned Prime Minister Suzuki’s residence, but shortly after dawn the coup was crushed. At noon that day, Emperor Hirohito went on national radio for the first time to announce the Japanese surrender. In his unfamiliar court language, he told his subjects, “we have resolved to pave the way for a grand peace for all the generations to come by enduring the unendurable and suffering what is insufferable.” The United States immediately accepted Japan’s surrender.", "end2"], ["President Truman appointed MacArthur to head the Allied occupation of Japan as Supreme Commander of the Allied Powers. For the site of Japan’s formal surrender, Truman chose the USS Missouri, a battleship that had seen considerable action in the Pacific and was named after Truman’s native state. MacArthur, instructed to preside over the surrender, held off the ceremony until September 2 in order to allow time for representatives of all the major Allied powers to arrive. On Sunday, September 2, more than 250 Allied warships lay at anchor in Tokyo Bay. The flags of the United States, Britain, the Soviet Union, and China fluttered above the deck of the Missouri. Just after 9 a.m. Tokyo time, Japanese Foreign Minister Mamoru Shigemitsu signed on behalf of the Japanese government. General Yoshijiro Umezu then signed for the Japanese armed forces, and his aides wept as he made his signature. Supreme Commander MacArthur next signed, declaring, “It is my earnest hope and indeed the hope of all mankind that from this solemn occasion a better world shall emerge out of the blood and carnage of the past.” Nine more signatures were made, by the United States, China, Britain, the USSR, Australia, Canada, France, the Netherlands and New Zealand, respectively. Admiral Chester W. Nimitz signed for the United States. As the 20-minute ceremony ended, the sun burst through low-hanging clouds. The most devastating war in human history was over.", "end3"]]
    }
    
]
